index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DOI Content Negotiation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="DOI Content Negotiation"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-13 10:31:53 GMT"/>
<meta name="author" content="Karl Ward"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/bootstrap.css"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">DOI Content Negotiation</h1>


<div class="container">


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Redirection</a></li>
<li><a href="#sec-3">3 What is Content Negotiation?</a>
<ul>
<li><a href="#sec-3-1">3.1 The Accept Header</a></li>
<li><a href="#sec-3-2">3.2 Response Codes</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Supported Content Types</a></li>
<li><a href="#sec-5">5 Determine a DOI's Registration Agency</a></li>
<li><a href="#sec-6">6 CrossRef and DataCite</a></li>
<li><a href="#sec-7">7 Getting Help</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
  DOIs provide a persistent link to content. They identify many types of work, 
  from journal articles to research data sets. Typically, someone interacting with 
  DOIs will be a researcher, who will resolve DOIs found in scholarly references 
  to content using the <a href='http://dx.doi.org'>DOI resolver</a>. Such
  researchers may not even realise they are using DOIs and the resolver
  since they may be follow dx.doi.org web links without interacting with the URL
  itself.
</p>
<p>
  Yet DOIs can provide more than a permanent, indirect link to content. DOI 
  registration agencies such as CrossRef and DataCite collect bibliographic metadata 
  about the works they link to. This metadata can be retrieved from the DOI resolver
  too, using content negotation to request a particular representation of the metadata.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Redirection</h2>
<div class="outline-text-2" id="text-2">


<p>
  The DOI resolver at dx.doi.org will normally redirect a user to the resource
  location of a DOI. For example, the DOI "10.1126/science.169.3946.635"
  redirects to a landing page describing the article, "The Structure of Ordinary Water".
  Content negotiated requests to dx.doi.org that ask for a content type which isn't
  "text/html" will be redirected to a metadata service hosted by DOI's registration
  agency. At time of writing, CrossRef and DataCite support content negotiated DOIs via
  <a href="http://data.crossref.org">http://data.crossref.org</a> and <a href="http://data.datacite.org">http://data.datacite.org</a>. mEDRA DOIs are also supported
  via the CrossRef metadata service.
</p>


  <div class="row"><div class="span6 offset3">

<pre class="example">       GET "Accept: text/html"
http://dx.doi.org/10.1126/science.169.3946.635

                   |
                   |
                   |
                   V

       Publisher landing page 
http://www.sciencemag.org/content/169/3946/635
</pre>

  </div></div>

<p>  
  Normal browser requests or explicit requests for text/html redirect to the content's
  landing page.
</p>


  <div class="row"><div class="span6 offset3">

<pre class="example">       GET "Accept: application/rdf+xml"
http://dx.doi.org/10.1126/science.169.3946.635 
                   
                   |
                   |
                   |
                   V

       CrossRef metadata service 
http://data.crossref.org/10.1126/science.169.3946.635
</pre>

  </div></div>

<p>
  Requests for a data type redirect to a RA metadata service.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> What is Content Negotiation?</h2>
<div class="outline-text-2" id="text-3">


<p>
  Content negotiation allows a web browser or some other computer program to request
  a particular representation of a web resource. The DOI resolver uses content
  negotation to provide different representations of metadata associated with DOIs.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The Accept Header</h3>
<div class="outline-text-3" id="text-3-1">


<p>
   Making a content negotiated request requires the use of a HTTP header, "Accept".
   Acceptable content types are declared in the Accept header, each with an optional
   "quality" value indicating its relative suitability. For example, a client that
   wishes to receive citeproc JSON if it is available, but which can also handle
   RDF XML if citeproc JSON is unavailable, would make a request with an Accept
   header listing both "application/citeproc+json" and "application/rdf+xml":
</p>



<pre class="example">$ curl -LH "Accept: application/rdf+xml;q=0.5, application/citeproc+json;q=1.0" http://dx.doi.org/10.5555/test_doi
</pre>


<p>
   This request favours citeproc JSON but will accept RDF XML if citeproc is unavailable.
   The q values are optional. The request could have been written without them. The
   order of content types then becomes important; more suitable content types should
   be placed at the front of the Accept header.
</p>



<pre class="example">$ curl -LH "Accept: application/citeproc+json, application/rdf+xml" http://dx.doi.org/10.5555/test_doi
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Response Codes</h3>
<div class="outline-text-3" id="text-3-2">


<table  border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="table table-bordered table-striped">
<caption></caption>
<colgroup><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Code</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="right">200</td><td class="left">The request was OK.</td></tr>
<tr><td class="right">400</td><td class="left">The DOI requested is malformed, or some other unspecified error.</td></tr>
<tr><td class="right">404</td><td class="left">The DOI requested doesn't exist.</td></tr>
<tr><td class="right">406</td><td class="left">Data service can't serve any of your requested content types.</td></tr>
</tbody>
</table>


<p>
   Individual RA metadata services may utilise additional response codes but they will
   always use the response codes above in event of the case described.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Supported Content Types</h2>
<div class="outline-text-2" id="text-4">


<p>
  Currently two DOI registration agencies have implemented content negotation for their 
  DOIs: CrossRef and DataCite. They support a number of metadata content types, some of
  which are common to both RAs:
</p>
<table  border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="table table-bordered table-striped">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Format</th><th scope="col" class="left">Content Type</th></tr>
</thead>
<tbody>
<tr><td class="left">RDF XML</td><td class="left">application/rdf+xml</td></tr>
<tr><td class="left">Turtle</td><td class="left">text/turtle</td></tr>
<tr><td class="left">Handle Admin JSON</td><td class="left">application/handle+json</td></tr>
<tr><td class="left">Citeproc JSON</td><td class="left">application/citeproc+json</td></tr>
</tbody>
</table>


<p>
  Each RA also supports specific, non-standard content types. Using content
  negotation it is possible to make a request that favours RA-specific content types
  and will degrade to respond with a more standard content type if it is not
  available. See the examples below.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Determine a DOI's Registration Agency</h2>
<div class="outline-text-2" id="text-5">


<p>
  Each DOI has a handle record that is available through DOI content negotiation.
  Handle records contain metadata about a DOI, including the name of registration
  agencies that control DOIs. Handle records can be retreived via the text/handle
  content type:
</p>



<pre class="example">$ curl -LH "Accept: application/handle+json" http://dx.doi.org/10.5555/test_doi
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> CrossRef and DataCite</h2>
<div class="outline-text-2" id="text-6">


<p>
  CrossRef and DataCite implement additional content types and features. For
  documentation see:
</p>
<ul>
<li><a href="http://data.datacite.org">http://data.datacite.org</a>
</li>
<li><a href="http://data.crossref.org">http://data.crossref.org</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Getting Help</h2>
<div class="outline-text-2" id="text-7">


<p>
  Please contact labs@crossref.org or cn@datacite.org for support.
</p>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-13 10:31:53 GMT</p>
<p class="author">Author: Karl Ward</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
